In [24]:
import pandas as pd 

titanic_df = pd.read_csv('titanic_train.csv')
titanic_df['size of Family'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,size of Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1

In [95]:
import pandas as pd 

titanic_df = pd.read_csv('titanic_train.csv')
titanic_df['Fare'] = titanic_df['Fare'].fillna(titanic_df['Fare'].median())
titanic_df['Fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [89]:
import pandas as pd 

titanic_df = pd.read_csv('titanic_train.csv')
titanic_df.groupby('Sex')['Survived'].count()

Sex
female    314
male      577
Name: Survived, dtype: int64

In [87]:
import pandas as pd 

titanic_df = pd.read_csv('titanic_train.csv')
titanic_df['Cabin existence'] = 0

titanic_df['Cabin existence'] = titanic_df['Cabin'].apply(lambda x: 0 if type(x) == float else  1 )

print(titanic_df['Cabin existence'])

0      0
1      1
2      0
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Cabin existence, Length: 891, dtype: int64

In [121]:
import pandas as pd 

titanic_df = pd.read_csv('titanic_train.csv')
 
titanic_df['Sex'].map({'male': 0, 'female': 1}).astype(int)

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 891, dtype: int32

In [159]:
import pandas as pd 

titanic_df = pd.read_csv('titanic_train.csv')
titanic_df[(titanic_df['Age'] <  22) & (titanic_df['Survived']== 1) & (titanic_df['Sex']== 'male')].count()

print("22세 미만의 생존 남성 수는", len(titanic_df[(titanic_df['Age'] <  22) & (titanic_df['Survived']== 1) & (titanic_df['Sex']== 'male')]), "명이였다")

22세 미만의 생존 남성 수는 30 명이였다

In [179]:
import pandas as pd 

titanic_df = pd.read_csv('titanic_train.csv')
titanic_groupby = titanic_df.groupby('Pclass')[['Fare']].mean()
titanic_groupby.iloc[0,0]

print("1등석 승객의 평균 요금은", titanic_groupby.iloc[0,0], "였습니다")

1등석 승객의 평균 요금은 84.15468749999992 였습니다

In [183]:
import pandas as pd 

titanic_df = pd.read_csv('titanic_train.csv')

titanic_df.groupby('Embarked')['Fare'].agg([max, min, 'mean'])

               max     min       mean
Embarked
C         512.3292  4.0125  59.954144
Q          90.0000  6.7500  13.276030
S         263.0000  0.0000  27.079812

In [228]:
import pandas as pd 

titanic_df = pd.read_csv('titanic_train.csv')
titanic_df = titanic_df[(titanic_df['Name'] == "Nakid, Mr. Sahid")]
print("Nakid, Sahid씨의 티켓 번호는", titanic_df.iloc[0,8], "이었다")

Nakid, Sahid씨의 티켓 번호는 2653 이었다